[
    {
        "title": "University of Glasgow - Wikipedia",
        "content": "The University of Glasgow (abbreviated as Glas. in post-nominals; Scottish Gaelic: Oilthigh Ghlaschu[5]) is a public research university in Glasgow, Scotland. Founded by papal bull in  1451 [O.S. 1450],[6] it is the fourth-oldest university in the English-speaking world and one of Scotland's four ancient universities. Along with the universities of Edinburgh, Aberdeen, and St Andrews, the university was part of the Scottish Enlightenment during the 18th century. In common with universities of the pre-modern era, Glasgow originally educated students primarily from wealthy backgrounds; however, it became a pioneer[citation needed] in British higher education in the 19th century by also providing for the needs of students from the growing urban and commercial middle class. Glasgow University served all of these students by preparing them for professions: law, medicine, civil service, teaching, and the church. It also trained smaller but growing numbers for careers in science and engineering.[7] The annual income of the institution for 2020–21 was £809.4 million of which £173.3 million was from research grants and contracts, with an expenditure of £693.1 million.[1] It is a member of Universitas 21, the Russell Group[8] and the Guild of European Research-Intensive Universities.    The university was originally located in the city's High Street; since 1870, its main campus has been at Gilmorehill in the City's West End.[9] Additionally, a number of university buildings are located elsewhere, such as the Veterinary School in Bearsden, and the Crichton Campus in Dumfries.[10] High educational standards, strict entrance requirements (4th highest in the UK)[11] and a strong international research reputation have made the university a competitive destination for students worldwide. Glasgow is a World Top 100 university[12] so that the institution is positioned at the top 1% of world universities.[13] More specifically, the University of Glasgow ranked 53rd[14] and 67th[15] globally in the 2020 CWTS Leiden and 2020 QS World University Ranking respectively, as well as placing nationally among the top 10 UK universities.[16][17]",
        "url": "https://en.wikipedia.org/wiki/University_of_Glasgow"
    }
]